app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources"
---
  def index
    @resources = Resource.all

INSERT INTO "resources" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Week 1"], ["description", "JFKSDFKANSDF"], ["user_id", 1], ["created_at", "2016-02-06 20:56:23.067678"], ["updated_at", "2016-02-06 20:56:23.067678"]]
---
  def create
    @resource = Resource.new(resource_params)
    @resource = current_user.resources.build(resource_params)

    respond_to do |format|
      if @resource.save

UPDATE "resources" SET "description" = $1, "updated_at" = $2 WHERE "resources"."id" = $3  [["description", "false wats up"], ["updated_at", "2016-02-07 02:26:24.064454"], ["id", 20]]
---
  def update
    respond_to do |format|
      if @resource.update(resource_params)

DELETE FROM "resources" WHERE "resources"."id" = $1  [["id", 1]]
---
  def destroy
    @resource.destroy

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_resource
      @resource = Resource.find(params[:id])