app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("comment", "resource_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "hell yeah!!!"], ["resource_id", 2], ["created_at", "2016-02-06 21:01:44.713048"], ["updated_at", "2016-02-06 21:01:44.713048"]]

    def set_review
      @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 2]]